package amodule.lesson.activity;

public class Json {
    static Object o1 = "{\n" +
            "    \"desc\": {\n" +
            "      \"title\": \"简介\",\n" +
            "      \"subTitle\": \"章节简介\",\n" +
            "      \"info\": \"鲫鱼豆腐汤是一道汉族名菜，属于粤菜菜系，口味咸鲜可口，鲫鱼具有很好的鲫鱼豆腐汤是一道汉族名菜，属于粤菜菜系，口味咸鲜可口，鲫鱼具有很好的鲫鱼豆腐汤是一道汉族名菜，属于粤菜菜系，口味咸鲜可口，鲫鱼具有很好的\"\n" +
            "    },\n" +
            "    \"videoDetail\": {\n" +
            "      \"title\": \"视频详解\",\n" +
            "      \"subTitle\": \"视频内容\",\n" +
            "      \"readyInfo\": {\n" +
            "        \"title\": \"一、准备工作\",\n" +
            "        \"img\": \"\"\n" +
            "      },\n" +
            "      \"mainPoints\": {\n" +
            "        \"title\": \"二、要点归纳\",\n" +
            "        \"info\": [\n" +
            "          {\n" +
            "            \"desc\": \"1、熬汤时为何要加开水？\",\n" +
            "            \"img\": \"\"\n" +
            "          },\n" +
            "          {\n" +
            "            \"desc\": \"2、煎鲫鱼时有哪些需要注意的问题？\",\n" +
            "            \"img\": \"\"\n" +
            "          }\n" +
            "        ]\n" +
            "      }\n" +
            "    },\n" +
            "    \"problem\": {\n" +
            "      \"title\": \"常见问题\",\n" +
            "      \"subTitle\": \"常见问题（3）\",\n" +
            "      \"info\": [\n" +
            "        {\n" +
            "          \"ask\": \"板栗是生的还是熟的下锅？\",\n" +
            "          \"answer\": \"司鹏飞(作者)：熟栗口味更佳。\",\n" +
            "          \"tag\": {\n" +
            "            \"color\": \"\",\n" +
            "            \"title\": \"问\",\n" +
            "            \"bgColor\": \"\"\n" +
            "          }\n" +
            "        },\n" +
            "        {\n" +
            "          \"ask\": \"8分钟肉咬得动吗？\",\n" +
            "          \"answer\": \"司鹏飞（作者）：8分钟指的是煎排骨的时间，此时的排骨已经完全成熟，可以咬动，是爽脆弹牙的口感。如果牙齿不好或者喜欢吃特别软烂的，炖制30分钟就可以。\",\n" +
            "          \"tag\": {\n" +
            "            \"color\": \"\",\n" +
            "            \"title\": \"问\",\n" +
            "            \"bgColor\": \"\"\n" +
            "          }\n" +
            "        }\n" +
            "      ]\n" +
            "    }\n" +
            "  },\n" +
            "  \"append\": [],\n" +
            "  \"power\": {},\n" +
            "  \"extra\": {\n" +
            "    \"execTime\": \"0.0005\",\n" +
            "    \"serverTime\": 1543840649,\n" +
            "    \"params\": {\n" +
            "      \"ss\": \"/main9/school/chapterDesc\",\n" +
            "      \"code\": \"1\",\n" +
            "      \"debug\": \"4d5c01842f37d90651f9693783c6564279fed6f4\"\n" +
            "    }\n" +
            "  }";
}
